{"posts":[{"title":"How To Use Hexo","text":"IntroductionThe combination of Hexo + GithubPages is easy way to configure your own blog. Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. StepsCreate a Github RepoYou should create a repo for your blog, and the repo name must be &lt;username&gt;.github.io. Init HexoThen, navigate to &lt;username&gt;.github.io directory, run the following command to init Hexo blog. 12# cd &lt;username&gt;.github.iohexo init Install DependenciesFinally, run the following command to finalize installing procedures. 1npm install Hexo Useful CommandsCreate a new postEnter &lt;username&gt;.github.io directory, and execute the following command for new page creation. If you haven’t specify layout, hexo will use the default layout for new page creation. The default layout is configured in _config.yml file, the keyword is default_layout. For more info, pleasesee chapter Writing. 12# hexo new [layout] &lt;title&gt;$ hexo new &quot;My New Post&quot; Run serverIf you want to preview your blog on your local machine, you can use following command to deploy your blog on your local machine. For more info, please see chapter Server. 1$ hexo server Generate static filesBefore you publish your blog to github pages, you should generate static files locally. If you use the github pages’s theme, you only need to configure wanted theme in your _config.yml file, and github will gengerate all static files before deploying. For more info, please see chapter Generating. 1$ hexo generate Deploy to Remote SitesAfter generating all static files, you can deploy your blog on github pages. This command would create a master branch in your blog repo. So your github pages should be based on master branch. You can change the github pages’ branch in Settings-&gt;Pages-&gt;Branch. 1$ hexo deploy For more info, please see chapter Deployment. ThemesInstall ThemeI’d like to use hexo-theme-icarus theme. User should execute the following commands to configure icarus theme. hexo-theme-icarus 12npm install hexo-theme-icarushexo config theme icarus Hexo provides numerous themes, please see Hexo-Themes for more details. Change Your Personnel InfoUser should change the personnel info in _config.icarus.yml file. NotesAll blog data are listed in source/ directory. My source directory hierarchy is as follows: 123456789101112» tree source source├── _posts│ ├── How-To-Use-Hexo.md│ └── hello-world.md└── img ├── alipay-qrcode.jpg ├── logo.png ├── logo.svg └── wechat-qrcode.jpg2 directories, 6 files If you want to change the default logo logo.svg, you should put your own logo.svg in source/img/logo.svg. Besides, Mac user can use imagemagick tool for png to svg conversion. For more details, you can see imagemagick-homepage. After install imagemagick tool, you can execute the following commands to convert. 1convert logo.png logo.svg References PicGo-Configuration Using-ssh-instead-of-http-in-config.yml-file Hexo-Doc","link":"/2022/10/30/How-To-Use-Hexo/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2022/10/30/hello-world/"},{"title":"CMAKE---Multiple directories","text":"OverviewCMake is a direcory-based project management tool. If your project has multiple directories, more CMakeLists.txt files should be created in your project directories. SituationReferences My-Advanced-CMake-Repo","link":"/2022/10/31/CMAKE-Multiple-directories/"}],"tags":[{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"CMake","slug":"CMake","link":"/tags/CMake/"}],"categories":[],"pages":[]}